tiendungtran-msl/nuttxspace/.history/nuttx/boards/arm/stm32h7/uav_states/src/stm32_bringup_20251230101648.c
/****************************************************************************
 * boards/arm/stm32h7/uav_states/src/stm32_bringup.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <syslog.h>
#include <errno.h>
#include <arch/board/board.h>
#include <nuttx/fs/fs.h>
#include <stdio.h>
#include "uav_states.h"
#include "stm32_gpio.h"

#ifdef CONFIG_STM32H7_SPI1
#  include "stm32_spi_icm.h"
#endif

#ifdef CONFIG_SPI_DRIVER
#  include <nuttx/spi/spi_transfer.h>
#endif

#ifdef CONFIG_STM32H7_I2C
#  include "stm32_i2c.h"
#  include <nuttx/i2c/i2c_master.h>
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_bringup
 *
 * Description:
 *   Perform architecture-specific initialization
 *
 *   CONFIG_BOARD_LATE_INITIALIZE=y :
 *     Called from board_late_initialize().
 *
 *   CONFIG_BOARD_LATE_INITIALIZE=n && CONFIG_BOARDCTL=y &&
 *   CONFIG_NSH_ARCHINIT:
 *     Called from the NSH library
 *
 ****************************************************************************/

int stm32_bringup(void)
{
  int ret = OK;

  UNUSED(ret);

  /* Đăng ký ngoại vi SPI cho ICM42688P */
  #ifdef CONFIG_STM32H7_SPI1
    struct spi_dev_s *spi_icm;

    /* Initialize SPI1 */
    ret = board_spi1_icm_initialize();
    if (ret < 0)
      {
        syslog(LOG_ERR, "ERROR: SPI1 initialization failed\n");
        return ret;
      }

    #ifdef CONFIG_SPI_DRIVER
      /* Register each ICM42688P as separate device */
      for (int i = 0; i < 4; i++)
        {
          char devname[16];
          spi_icm = board_spi1_icm_get_device(i);
          if (spi_icm != NULL)
            {
              /* Liệt kê và đăng ký thiết bị SPI */
              snprintf(devname, sizeof(devname), "/dev/spi%d", i);
              ret = spi_register(spi_icm, i);
              
              if (ret >= 0)
                {
                  syslog(LOG_INFO, "Registered %s\n", devname);
                }
            }
        }
    #endif
  #endif

  #ifdef CONFIG_DEV_GPIO
    /* Initialize GPIO LED device */
    ret = stm32_gpio_led_initialize();
    if (ret < 0)
      {
        syslog(LOG_ERR, "ERROR: Failed to initialize GPIO LED: %d\n", ret);
      }
  #endif

/* Đăng ký I2C cho BMM150 */
#ifdef CONFIG_STM32H7_I2C
  struct i2c_master_s *i2c;
  /* Khởi tạo I2C1 */
  i2c = stm32_i2cbus_initialize(1); // Port I2C1
  if (i2c == NULL)
  {
      /* Lỗi khởi tạo I2C1 */
      printf("Failed to initialize i2c bus\n");
      return -ENODEV;
  }

  /* Đăng ký device node /dev/i2c1 */
  ret = i2c_register(i2c, 1);
  if (ret < 0)
  {
      /* Lỗi đăng ký */
      printf("Failed to register i2c\n");
      stm32_i2cbus_uninitialize(i2c);
      return ret;
  }
#endif /* CONFIG_STM32H7_I2C */

  syslog(LOG_INFO, "SYSCLK: %ld Hz\n", STM32_SYSCLK_FREQUENCY);
  syslog(LOG_INFO, "HCLK: %ld Hz\n", STM32_HCLK_FREQUENCY);
  syslog(LOG_INFO, "PCLK1: %ld Hz\n", STM32_PCLK1_FREQUENCY);

  return OK;
}
